In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
})

In [5]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [7]:
df[['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [9]:
# Filter rows where Age > 25
filtered_df = df[df['Age'] > 25]
print(filtered_df)

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [11]:
# Using query for a more SQL-like syntax
filtered_df_query = df.query('Age > 25')
print(filtered_df_query)

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [13]:
filtered_df_query['Age']

1    30
2    35
Name: Age, dtype: int64

In [19]:
# Sort by Age in ascending order
df_sorted = df.sort_values(by='Age', ascending=True)
print(df_sorted)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [21]:
# Sort by Age in descending order
df_sorted_desc = df.sort_values(by='Age', ascending=False)
print(df_sorted_desc)

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   30  Los Angeles
0    Alice   25     New York

In [23]:
df = pd.DataFrame({
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 70000, 55000, 80000]
})

In [27]:
# Group by Department and calculate average Salary
grouped_df = df.groupby('Department')['Salary'].mean()

In [29]:
grouped_df

Department
Finance    80000.0
HR         52500.0
IT         65000.0
Name: Salary, dtype: float64

In [31]:
grouped_df = df.groupby('Department')['Salary'].mean().reset_index()

In [33]:
grouped_df

  Department   Salary
0    Finance  80000.0
1         HR  52500.0
2         IT  65000.0

In [35]:
# Multiple aggregations
agg_df = df.groupby('Department').agg(
    Avg_Salary=('Salary', 'mean'),
    Total_Salary=('Salary', 'sum')
).reset_index()

In [37]:
agg_df

  Department  Avg_Salary  Total_Salary
0    Finance     80000.0         80000
1         HR     52500.0        105000
2         IT     65000.0        130000

In [39]:
# Sample data
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Age': [25, 30, 35]})

In [41]:
# Inner join (default)
merged_inner = pd.merge(df1, df2, on='ID', how='inner')
print(merged_inner)

   ID   Name  Age
0   1  Alice   25
1   2    Bob   30

In [43]:
# Left join
merged_left = pd.merge(df1, df2, on='ID', how='left')
print(merged_left)

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN

In [45]:
# Right join
merged_right = pd.merge(df1, df2, on='ID', how='right')
print(merged_right)

   ID   Name  Age
0   1  Alice   25
1   2    Bob   30
2   4    NaN   35

In [47]:
# Outer join
merged_outer = pd.merge(df1, df2, on='ID', how='outer')
print(merged_outer)

   ID     Name   Age
0   1    Alice  25.0
1   2      Bob  30.0
2   3  Charlie   NaN
3   4      NaN  35.0

In [49]:
# Vertical concatenation
df3 = pd.DataFrame({'ID': [5, 6], 'Name': ['David', 'Eve']})
concat_df = pd.concat([df1, df3], ignore_index=True)
print(concat_df)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   5    David
4   6      Eve

In [51]:
# Horizontal concatenation
df_horizontal = pd.concat([df1, df2], axis=1)
print(df_horizontal)

   ID     Name  ID  Age
0   1    Alice   1   25
1   2      Bob   2   30
2   3  Charlie   4   35

In [53]:
df = pd.DataFrame({'Sales': [200, 300, 400, 500, 600]})

In [61]:
# Calculate rolling average for last 3 rows
df['Rolling_Avg'] = df['Sales'].rolling(window=3).mean()
print(df)

   Sales  Rolling_Avg
0    200          NaN
1    300          NaN
2    400        300.0
3    500        400.0
4    600        500.0

In [63]:
# Expanding mean (cumulative average)
df['Expanding_Mean'] = df['Sales'].expanding().mean()
print(df)

   Sales  Rolling_Avg  Expanding_Mean
0    200          NaN           200.0
1    300          NaN           250.0
2    400        300.0           300.0
3    500        400.0           350.0
4    600        500.0           400.0

In [65]:
# Filter using query
high_salary_df = df.query('Sales > 400')
print(high_salary_df)

   Sales  Rolling_Avg  Expanding_Mean
3    500        400.0           350.0
4    600        500.0           400.0

In [69]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandasql) (1.26.4)
Requirement already satisfied: pandas in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandasql) (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandasql) (2.0.30)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandas->pandasql) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandas->pandasql) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\surjayandutta\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\surjayandutta\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\surjayandutta\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\surjayandutta\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26801 sha256=a6992f8758aa2f2bb3e315681c23b0127ffe1c14d0bd678251c0acc70cb5080d
  Stored in directory: c:\users\surjayandutta\appdata\local\pip\cache\wheels\15\a1\e7\6f92f295b5272ae5c02365e6b8fa19cb93f16a537090a1cf27
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [71]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
})

In [75]:
import pandasql as ps

In [77]:
query = "SELECT * FROM df WHERE Age > 25"
result = ps.sqldf(query, locals())

In [79]:
result

      Name  Age         City
0      Bob   30  Los Angeles
1  Charlie   35      Chicago

In [81]:
print(result)

      Name  Age         City
0      Bob   30  Los Angeles
1  Charlie   35      Chicago

In [83]:
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Salary': [60000, 80000, 70000, 90000],
    'Age': [34, 28, 45, 31]
})

In [89]:
# Filter employees in IT or Finance department with a salary > 75000
filtered_df = df.query("Department in ['IT', 'Finance'] and Salary > 75000")

In [91]:
print(filtered_df)

  Employee Department  Salary  Age
1      Bob         IT   80000   28
3    David         IT   90000   31

In [95]:
# Sample data
df = pd.DataFrame({
    'Department': ['HR', 'IT', 'IT', 'Finance', 'Finance', 'HR'],
    'Region': ['East', 'West', 'West', 'East', 'West', 'East'],
    'Salary': [50000, 60000, 70000, 55000, 80000, 58000]
})

# Group by Department and Region and calculate mean and sum for Salary
grouped_df = df.groupby(['Department', 'Region']).agg(
    Avg_Salary=('Salary', 'mean'),
    Total_Salary=('Salary', 'sum')
).reset_index()
print(grouped_df)

  Department Region  Avg_Salary  Total_Salary
0    Finance   East     55000.0         55000
1    Finance   West     80000.0         80000
2         HR   East     54000.0        108000
3         IT   West     65000.0        130000

In [99]:
import pandas as pd

# Sample data
df = pd.DataFrame({
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR'],
    'Year': [2021, 2021, 2022, 2022, 2021],
    'Salary': [50000, 60000, 65000, 70000, 55000]
})

# Pivot table with aggregation (e.g., using mean)
pivoted_df = df.pivot_table(index='Department', columns='Year', values='Salary', aggfunc='mean')
print(pivoted_df)

Year           2021     2022
Department
Finance         NaN  70000.0
HR          52500.0      NaN
IT          60000.0  65000.0

In [101]:
# Unpivot the DataFrame back
unpivoted_df = pivoted_df.reset_index().melt(id_vars='Department', var_name='Year', value_name='Salary')
print(unpivoted_df)

  Department  Year   Salary
0    Finance  2021      NaN
1         HR  2021  52500.0
2         IT  2021  60000.0
3    Finance  2022  70000.0
4         HR  2022      NaN
5         IT  2022  65000.0

In [107]:
# Sample data with missing values
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie'],
    'Salary': [50000, None, 70000],
    'Bonus': [5000, 8000, None]
})

# Use fillna to replace missing Salary values
df['Salary'] = df['Salary'].fillna(60000)

In [109]:
print(df)

  Employee   Salary   Bonus
0    Alice  50000.0  5000.0
1      Bob  60000.0  8000.0
2  Charlie  70000.0     NaN

In [111]:
# Use combine_first to replace NaN in Bonus with a default value
df['Bonus'] = df['Bonus'].combine_first(pd.Series([3000, 3000, 3000]))

In [113]:
df

  Employee   Salary   Bonus
0    Alice  50000.0  5000.0
1      Bob  60000.0  8000.0
2  Charlie  70000.0  3000.0

In [115]:
import numpy as np

# Sample data
df = pd.DataFrame({
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Salary': [50000, 60000, 70000, 80000]
})

# Add a new column with conditional values
df['Salary_Category'] = np.where(df['Salary'] >= 70000, 'High', 'Low')
print(df)

  Department Employee  Salary Salary_Category
0         HR    Alice   50000             Low
1         IT      Bob   60000             Low
2    Finance  Charlie   70000            High
3         IT    David   80000            High

In [117]:
df['Salary_Category'] = df['Salary'].apply(lambda x: 'High' if x >= 70000 else ('Medium' if x >= 60000 else 'Low'))
print(df)

  Department Employee  Salary Salary_Category
0         HR    Alice   50000             Low
1         IT      Bob   60000          Medium
2    Finance  Charlie   70000            High
3         IT    David   80000            High

In [119]:

df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Salary': [50000, 70000, 90000, 40000]
})

# Define conditions and corresponding choices
conditions = [
    (df['Salary'] < 50000),
    (df['Salary'] >= 50000) & (df['Salary'] < 80000),
    (df['Salary'] >= 80000)
]
choices = ['Low', 'Medium', 'High']

# Create new column with conditional values
df['Salary_Category'] = np.select(conditions, choices, default='Unknown')

In [121]:
print(df)

  Employee Department  Salary Salary_Category
0    Alice         HR   50000          Medium
1      Bob         IT   70000          Medium
2  Charlie    Finance   90000            High
3    David         IT   40000             Low

In [123]:

df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Salary': [50000, 70000, 90000, 40000]
})

# Derived table example: Get average salary by department
average_salary_df = df.groupby('Department')['Salary'].mean().reset_index()
average_salary_df.columns = ['Department', 'Avg_Salary']

# Now join the original table with this derived table to get each employee's salary relative to their department average
df = pd.merge(df, average_salary_df, on='Department')
df['Salary_vs_Avg'] = df['Salary'] - df['Avg_Salary']

In [125]:
df

  Employee Department  Salary  Avg_Salary  Salary_vs_Avg
0    Alice         HR   50000     50000.0            0.0
1      Bob         IT   70000     55000.0        15000.0
2  Charlie    Finance   90000     90000.0            0.0
3    David         IT   40000     55000.0       -15000.0

In [129]:
# Sample data
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'Finance'],
    'Salary': [50000, 70000, 90000, 80000, 85000]
})

# Rank employees within each department by salary
df['Rank'] = df.groupby('Department')['Salary'].rank(method='dense', ascending=False)

In [131]:
print(df)

  Employee Department  Salary  Rank
0    Alice         HR   50000   1.0
1      Bob         IT   70000   2.0
2  Charlie    Finance   90000   1.0
3    David         IT   80000   1.0
4      Eve    Finance   85000   2.0

In [133]:

# Alternatively, ROW_NUMBER() behavior (no ties)
df['Row_Number'] = df.groupby('Department')['Salary'].rank(method='first', ascending=False)

In [135]:
df

  Employee Department  Salary  Rank  Row_Number
0    Alice         HR   50000   1.0         1.0
1      Bob         IT   70000   2.0         2.0
2  Charlie    Finance   90000   1.0         1.0
3    David         IT   80000   1.0         1.0
4      Eve    Finance   85000   2.0         2.0

In [137]:
# Sample data
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'Finance'],
    'Salary': [50000, 70000, 90000, 80000, 85000]
})

# Calculate the percentage of total department salary for each employee
df['Dept_Total_Salary'] = df.groupby('Department')['Salary'].transform('sum')
df['Salary_Percentage'] = df.apply(lambda x: (x['Salary'] / x['Dept_Total_Salary']) * 100, axis=1)

In [139]:
df

  Employee Department  Salary  Dept_Total_Salary  Salary_Percentage
0    Alice         HR   50000              50000         100.000000
1      Bob         IT   70000             150000          46.666667
2  Charlie    Finance   90000             175000          51.428571
3    David         IT   80000             150000          53.333333
4      Eve    Finance   85000             175000          48.571429

In [141]:
# Sample data
df = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Manager': ['None', 'Alice', 'Alice', 'Bob'],
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Salary': [50000, 70000, 90000, 40000]
})

# Perform a self join to get manager details for each employee
df_self_join = pd.merge(df, df, left_on='Manager', right_on='Employee', suffixes=('', '_Manager'))

In [143]:
print(df_self_join[['Employee', 'Department', 'Salary', 'Manager', 'Department_Manager', 'Salary_Manager']])

  Employee Department  Salary Manager Department_Manager  Salary_Manager
0      Bob         IT   70000   Alice                 HR           50000
1  Charlie    Finance   90000   Alice                 HR           50000
2    David         IT   40000     Bob                 IT           70000

In [145]:
# Sample data
df1 = pd.DataFrame({'Employee': ['Alice', 'Bob'], 'Department': ['HR', 'IT'], 'Salary': [50000, 70000]})
df2 = pd.DataFrame({'Employee': ['Charlie', 'Alice'], 'Department': ['Finance', 'HR'], 'Salary': [90000, 50000]})

In [147]:
# Union all (SQL UNION ALL equivalent)
union_all_df = pd.concat([df1, df2], ignore_index=True)
print("Union All:\n", union_all_df)

Union All:
   Employee Department  Salary
0    Alice         HR   50000
1      Bob         IT   70000
2  Charlie    Finance   90000
3    Alice         HR   50000

In [149]:
# Union (SQL UNION equivalent, removes duplicates)
union_df = pd.concat([df1, df2], ignore_index=True).drop_duplicates()
print("Union (No Duplicates):\n", union_df)

Union (No Duplicates):
   Employee Department  Salary
0    Alice         HR   50000
1      Bob         IT   70000
2  Charlie    Finance   90000